app/controllers/account_controller.rb

  def signup
    case request.method
      when :post
        @user = User.new(params['user'])
        if @user.save
---
INSERT INTO "users" ("login", "password") VALUES('will.bailey', '4093124825fda27ea9db8de76c4c06b66d2d7146')

  def update_color
    tag = Tag.find_by_id(params[:tag_id])
    tag.color = params[:tag][:color]
    tag.save
---
SELECT * FROM "tags" WHERE ("tags"."id" = '2') LIMIT 1
UPDATE "tags" SET "color" = 'blue' WHERE "id" = 2