app/controllers/notes_controller.rb

SELECT * FROM "notes" WHERE ("notes".user_id = 2) ORDER BY date desc, id desc
---
  def index
    @notes = current_user.notes.find(:all,:order => "date desc, id desc")

SELECT * FROM "notes" WHERE ("notes"."id" = 10 AND ("notes".user_id = 2))
---
  def get_descr
    @note = current_user.notes.find(params[:id])

INSERT INTO "notes" ("x", "date", "y", "z", "description", "color", "user_id", "favorite") VALUES(NULL, '2008-12-23 12:45:25', NULL, NULL, NULL, NULL, 2, NULL)
---
  def new
    @note = current_user.notes.create(:date=>Time.now)

SELECT * FROM "notes" WHERE ("notes"."id" = 10 AND ("notes".user_id = 2))
UPDATE "notes" SET "description" = '!http://farm3.static.flickr.com/2127/2063014002_4c4e555c48_m.jpg!
---
  def update_descr
    @note = current_user.notes.find(params[:id])
    @note.description=params[:value]
    @note.save

SELECT * FROM "notes" WHERE ("notes"."id" = 1 AND ("notes".user_id = 2))
UPDATE "notes" SET "y" = 161, "x" = -60, "z" = 5 WHERE "id" = 42
---
  def update_position
    @note = current_user.notes.find(params[:id])
    if !@note.nil?
     @note.x = params[:x]
     @note.y = params[:y]
     @note.z = params[:z]
     @note.save

SELECT * FROM "notes" WHERE ("notes"."id" = 7 AND ("notes".user_id = 2))
DELETE FROM "notes" WHERE "id" = 7
SELECT "tags".* FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id WHERE (("taggings".taggable_type = 'Note') AND ("taggings".taggable_id = 63))
SELECT * FROM "taggings" WHERE ("taggings".taggable_id = 7 AND "taggings".taggable_type = 'Note')
---
  def destroy
    begin
      @notes = current_user.notes.find(:all)
      @note = current_user.notes.find(params[:id])
      if !@note.nil?
        @note.destroy
        taggings = @note.taggings.length

SELECT * FROM "notes" WHERE ("notes".user_id = 2)
SELECT "tags".* FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id WHERE (("taggings".taggable_type = 'Note') AND ("taggings".taggable_id = 11))
---
  def add_tag
   @notes = current_user.notes
   @note = Note.find(params[:id])
   if params[:value].blank? || params[:value] == 'add tags to this note'
     @note.tag_with("", current_user)
     render :update do |page|
       page.replace_html('tags' + params[:id].to_s, "add tags to this note")
       page.replace_html('cloud', generate_tag_cloud())
     end
   else
     @note.tag_with(params[:value], current_user)
     render :update do |page|
       page.replace_html('tags' + params[:id].to_s, @note.tags.collect{|tag| tag.name}.join(", "))

SELECT "tags".* FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id WHERE (("taggings".taggable_type = 'Note') AND ("taggings".taggable_id = 11))
---
  def search_by_tag
    @notes = if tag_name = params[:tag_search]
    # begin
    Note.find_tagged_with_by_user(params[:tag_search], current_user)

SELECT * FROM "notes" WHERE ("notes"."id" = 10 AND ("notes".user_id = 2))
INSERT INTO "note_files" ("filetype", "note_id", "systempath", "filename") VALUES('image/jpeg', 72, 'will/72/', 'Photo_4.jpg')
---
  def add_file
     @note = current_user.notes.find(params[:id])
    File.open(RAILS_ROOT + "/tmp/#{current_user.id.to_s}_#{@note.id.to_s}", "wb"){ |f| f.write("done")}
    @note_file = @note.note_files.build
    if @note_file.add_file(params[:note_file][:file])
      @note_file.save

SELECT * FROM "notes" WHERE ("notes"."id" = 72 AND ("notes".user_id = 2))
SELECT * FROM "note_files" WHERE ("note_files"."id" = 9 AND ("note_files".note_id = 72))
DELETE FROM "note_files" WHERE "id" = 9
---
  def delete_file
    @note = current_user.notes.find(params[:id])
    @note_file = @note.note_files.find(params[:note_file_id])
    @note_file.destroy

SELECT * FROM "note_files" WHERE ("note_files"."id" = 6 AND ("note_files".note_id = 42))
SELECT * FROM "notes" WHERE ("notes"."id" = 10 AND ("notes".user_id = 2))
---
  def get_file
  @note_file = current_user.notes.find(params[:id]).note_files.find(params[:file_id])